Tekla Open API Reference for Tekla Structures 2025
CannotSetAttributeForPluginException Class
 The CannotSetAttributeForPluginException class defines the exception that is thrown when Plugin.SetAttribute is called but the attribute cannot be set.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.CannotSetAttributeForPluginException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class CannotSetAttributeForPluginException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class CannotSetAttributeForPluginException
	Inherits TeklaStructuresDrawingsApplicationException
Constructors
Name | Description
CannotSetAttributeForPluginException()
 Creates a new CannotSetAttributeForPluginException instance.
CannotSetAttributeForPluginException(String)
 Creates a new CannotSetAttributeForPluginException instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace